{
  "textTranslations": {
    "Home": "Inicio",
    "Students": "Estudiantes",
    "Teachers": "Profesores",
    "Games": "Juegos",
    "Guess the word": "Adivina la palabra",
    "Learn Spanish with Spanish With Ignacio!": "¡Aprende español con Spanish With Ignacio!",
    "Resources for students": "Recursos para estudiantes",
    "Select your level to access personalized activities and materials.": "Selecciona tu nivel para acceder a actividades y materiales personalizados.",
    "Grammar 📘": "Gramática 📘",
    "Vocabulary 🧠": "Vocabulario 🧠",
    "Listening 🎧": "Comprensión auditiva 🎧",
    "Reading 📖": "Lectura 📖",
    "Writing ✍️": "Escritura ✍️",
    "Present tense": "Presente de indicativo",
    "Learn step by step how to talk about what you do each day, what you like, and simple things about yourself.": "Aprende paso a paso a hablar de lo que haces cada día, lo que te gusta y detalles sencillos sobre ti.",
    "Reflexive verbs": "Verbos reflexivos",
    "Discover why some verbs end in “se” and practice how to use them to say what you do for yourself.": "Descubre por qué algunos verbos terminan en “se” y practica cómo usarlos para decir lo que haces por ti mismo.",
    "Direct object pronouns": "Pronombres de objeto directo",
    "Learn to swap people or things for pronouns like lo and la so you can speak in a short, clear way.": "Aprende a sustituir personas o cosas por pronombres como lo y la para hablar de forma breve y clara.",
    "Verb “gustar”": "Verbo “gustar”",
    "Understand in a simple way how to use gustar to say what you like and what you do not, without complications.": "Comprende de forma sencilla cómo usar gustar para decir lo que te gusta y lo que no, sin complicaciones.",
    "The alphabet": "El abecedario",
    "Learn how to pronounce every letter of the Spanish alphabet and practice their order with guided activities.": "Aprende a pronunciar cada letra del alfabeto español y practica su orden con actividades guiadas.",
    "Basic expressions to start talking": "Expresiones básicas para empezar a hablar",
    "Discover greetings, farewells, and essential phrases to start conversations confidently from day one.": "Descubre saludos, despedidas y frases esenciales para iniciar conversaciones con confianza desde el primer día.",
    "Countries and nationalities": "Países y nacionalidades",
    "Match countries with their demonyms and practice introducing yourself and talking about others accurately.": "Relaciona países con sus gentilicios y practica cómo presentarte y hablar de otras personas con precisión.",
    "Numbers (0-100)": "Números (0-100)",
    "Review basic numbers with listening and writing exercises to talk about ages, prices, and quantities.": "Repasa los números básicos con ejercicios de escucha y escritura para hablar de edades, precios y cantidades.",
    "Professions": "Profesiones",
    "Expand your work vocabulary with visual flashcards and model phrases to talk about professions and workplaces.": "Amplía tu vocabulario laboral con tarjetas visuales y frases modelo para hablar de profesiones y lugares de trabajo.",
    "The weather": "El clima",
    "Practice common expressions to describe the weather and plan activities based on the temperature or season.": "Practica expresiones comunes para describir el tiempo y planear actividades según la temperatura o la estación.",
    "Resources for teachers": "Recursos para profesores",
    "Support your classes with ready-to-use activities, dynamic strategies, and digital tools created by Ignacio.": "Apoya tus clases con actividades listas para usar, estrategias dinámicas y herramientas digitales creadas por Ignacio.",
    "Explore downloadable materials, activity ideas, and templates to keep your students motivated.": "Explora materiales descargables, ideas de actividades y plantillas para mantener motivados a tus estudiantes.",
    "Lesson plans": "Planes de clase",
    "Complete sequences with objectives, steps, and extra resources for every CEFR level.": "Secuencias completas con objetivos, pasos y recursos adicionales para cada nivel del MCER.",
    "Interactive activities": "Actividades interactivas",
    "Digital games, guided debates, and cooperative tasks ready to share with your groups.": "Juegos digitales, debates guiados y tareas cooperativas listas para compartir con tus grupos.",
    "Printable material": "Material imprimible",
    "Worksheets, vocabulary cards, and graphic organizers in PDF to print or edit.": "Fichas, tarjetas de vocabulario y organizadores gráficos en PDF para imprimir o editar.",
    "Training": "Formación",
    "Update your teaching skills with practical workshops and professional collaboration spaces.": "Actualiza tus habilidades docentes con talleres prácticos y espacios de colaboración profesional.",
    "Live sessions": "Sesiones en vivo",
    "Join monthly sessions with Ignacio to analyze real cases and share best practices.": "Únete a sesiones mensuales con Ignacio para analizar casos reales y compartir buenas prácticas.",
    "More information": "Más información",
    "Next session: \"Designing activities for real communication.\" Includes a recording and downloadable materials.": "Próxima sesión: \"Diseñar actividades para la comunicación real\". Incluye grabación y materiales descargables.",
    "Self-paced course": "Curso a tu ritmo",
    "Advance at your own pace with modules on assessment, gamification, and effective feedback.": "Avanza a tu propio ritmo con módulos sobre evaluación, gamificación y retroalimentación efectiva.",
    "Includes short videos, editable templates, and private forums to resolve questions with other teachers.": "Incluye vídeos cortos, plantillas editables y foros privados para resolver dudas con otros docentes.",
    "Teaching community": "Comunidad docente",
    "Share resources, organize class exchanges, and receive feedback from colleagues.": "Comparte recursos, organiza intercambios de clase y recibe retroalimentación de colegas.",
    "Access a private space with monthly challenges, newsletters, and co-creation sessions for materials.": "Accede a un espacio privado con retos mensuales, boletines y sesiones de cocreación de materiales.",
    "Interactive games": "Juegos interactivos",
    "Practice your Spanish with digital activities designed for each level.": "Practica tu español con actividades digitales diseñadas para cada nivel.",
    "Guess the Word": "Adivina la palabra",
    "Challenge yourself with a Wordle-style game to grow your Spanish vocabulary level by level.": "Rétate con un juego tipo Wordle para ampliar tu vocabulario de español nivel a nivel.",
    "The power of verbs!": "¡El poder de los verbos!",
    "Defend the kingdom by conjugating Spanish verbs and power up your hero with every correct answer.": "Defiende el reino conjugando verbos en español y fortalece a tu héroe con cada respuesta correcta.",
    "Letter loop": "La rueda de letras",
    "Find words by combining letters arranged in a circle, inspired by the Wordscapes-style puzzles.": "Encuentra palabras combinando letras que aparecen en un círculo, al estilo del juego Wordscapes.",
    "Crossword battle": "La batalla de crucigramas",
    "Compete in a Scrabble-style showdown: fill a grid with 5 letters per turn and outscore the system.": "Compite estilo Scrabble: completa una cuadrícula con 5 letras por turno y gana más puntos que el sistema.",
    "This game will be available soon.": "Este juego estará disponible pronto.",
    "Choose how you want to play": "Elige cómo quieres jugar",
    "Daily puzzle": "Reto diario",
    "Solve the challenge of the day by choosing your level and testing your vocabulary.": "Resuelve el desafío del día eligiendo tu nivel y poniendo a prueba tu vocabulario.",
    "Play now": "Jugar ahora",
    "Adventure mode": "Modo aventura",
    "Advance through the map by completing challenges and unlocking new missions.": "Avanza por el mapa completando desafíos y desbloqueando nuevas misiones.",
    "Explore the map": "Explora el mapa",
    "Beginner": "Principiante",
    "Elementary": "Elemental",
    "Intermediate": "Intermedio",
    "Upper-Intermediate": "Intermedio alto",
    "Advanced": "Avanzado",
    "Proficient": "Competente",
    "Available soon": "Disponible pronto"
  },
  "titleTranslations": {
    "Spanish with Ignacio - Home": "Spanish with Ignacio - Inicio",
    "Spanish with Ignacio - Students": "Spanish with Ignacio - Estudiantes",
    "Spanish with Ignacio - Teachers": "Spanish with Ignacio - Profesores",
    "Spanish with Ignacio - Games": "Spanish with Ignacio - Juegos",
    "Adivina la Palabra - Spanish with Ignacio": "Adivina la Palabra - Spanish with Ignacio",
    "Spanish with Ignacio - Adventure mode": "Spanish with Ignacio - Modo aventura",
    "Spanish with Ignacio - Students A1 Grammar": "Spanish with Ignacio - Estudiantes A1 Gramática",
    "Spanish with Ignacio - Students A1 Vocabulary": "Spanish with Ignacio - Estudiantes A1 Vocabulario",
    "Spanish with Ignacio - Professions": "Spanish with Ignacio - Profesiones",
    "Guess the Word - Game": "Adivina la palabra - Juego"
  },
  "htmlTranslations": {
    "Learn to swap people or things for pronouns like <em>lo</em> and <em>la</em> so you can speak in a short, clear way.": "Aprende a sustituir personas o cosas por pronombres como <em>lo</em> y <em>la</em> para hablar de forma breve y clara."
  }
}
